In [1]:
import pandas as pd 
import matplotlib.pyplot as plt

In [ ]:

data = pd.read_csv(r"C:\Users\Lenovo\OneDrive\Documents\Projects\Luke Barousse Projects\Python Course  Data Analysis\data_jobs.csv")

In [5]:
df = data

In [8]:
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [9]:
df.iloc[0]

job_title_short                                               Data Analyst
job_title                                                   Data Analytics
job_location                                 Monterrey, Nuevo Leon, Mexico
job_via                                                          via BeBee
job_schedule_type                                                Part-time
job_work_from_home                                                   False
search_location                                                     Mexico
job_posted_date                                        2023-12-05 07:26:05
job_no_degree_mention                                                False
job_health_insurance                                                 False
job_country                                                         Mexico
salary_rate                                                            NaN
salary_year_avg                                                        NaN
salary_hour_avg                                                        NaN
company_name                         2U Bootcamps Instructional Engagement
job_skills               ['go', 'python', 'mongodb', 'mongodb', 'css', ...
job_type_skills          {'analyst_tools': ['tableau'], 'databases': ['...
Name: 0, dtype: object

In [18]:
df.loc[:,'salary_rate':'salary_hour_avg'].dropna(subset='salary_rate')

       salary_rate  salary_year_avg  salary_hour_avg
16            hour              NaN        57.060001
18            year          56700.0              NaN
45            year         100000.0              NaN
48            hour              NaN        40.099998
51            hour              NaN        47.620003
...            ...              ...              ...
787368        year         125000.0              NaN
787496        year         115000.0              NaN
787497        year         147500.0              NaN
787505        year         145000.0              NaN
787513        year         175000.0              NaN

[33073 rows x 3 columns]